//---------------------------------------------------------------------------
#ifndef __CONUTILS_H__
#define __CONUTILS_H__
//---------------------------------------------------------------------------
#ifdef __cplusplus
extern "C" {
#endif  // __cplusplus
//---------------------------------------------------------------------------
// Отображение/скрытие курсора на экране консоли
BOOL ShowConsoleCursor(
  BOOL bVisible
  );
// Вывод текста на экран консоли
BOOL OutText(
  const TCHAR *pszText
  );
// Получение атрибутов текста
int GetTextAttr(void);
// Установка атрибутов текста
int SetTextAttr(
  int attr
  );
//---------------------------------------------------------------------------
#ifdef __cplusplus
}  // extern "C"
#endif // __cplusplus
//---------------------------------------------------------------------------
#endif // __CONUTILS_H__
